In [61]:
import pandas as pd
import sqlalchemy
from sqlalchemy import create_engine
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [148]:
engine = create_engine('sqlite://',echo = False)
census.to_sql('census',con = engine)
crime.to_sql('crime',con = engine)
school.to_sql('school',con = engine)

In [149]:
df = pd.read_sql_query('Select * from crime',con = engine)
df.head()

,index,ID,CASE_NUMBER,DATE,BLOCK,IUCR,PRIMARY_TYPE,DESCRIPTION,LOCATION_DESCRIPTION,ARREST,...,DISTRICT,WARD,COMMUNITY_AREA_NUMBER,FBICODE,X_COORDINATE,Y_COORDINATE,YEAR,LATITUDE,LONGITUDE,LOCATION
0,0,3512276,HK587712,2004-08-28,047XX S KEDZIE AVE,890,THEFT,FROM BUILDING,SMALL RETAIL STORE,0,...,9,14.0,58.0,6,1155838.0,1873050.0,2004,41.807440,-87.703956,"(41.8074405, -87.703955849)"
1,1,3406613,HK456306,2004-06-26,009XX N CENTRAL PARK AVE,820,THEFT,$500 AND UNDER,OTHER,0,...,11,27.0,23.0,6,1152206.0,1906127.0,2004,41.898280,-87.716406,"(41.898279962, -87.716405505)"
2,2,8002131,HT233595,2011-04-04,043XX S WABASH AVE,820,THEFT,$500 AND UNDER,NURSING HOME/RETIREMENT HOME,0,...,2,3.0,38.0,6,1177436.0,1876313.0,2011,41.815933,-87.624642,"(41.815933131, -87.624642127)"
3,3,7903289,HT133522,2010-12-30,083XX S KINGSTON AVE,840,THEFT,FINANCIAL ID THEFT: OVER $300,RESIDENCE,0,...,4,7.0,46.0,6,1194622.0,1850125.0,2010,41.743665,-87.562463,"(41.743665322, -87.562462756)"
4,4,10402076,HZ138551,2016-02-02,033XX W 66TH ST,820,THEFT,$500 AND UNDER,ALLEY,0,...,8,15.0,66.0,6,1155240.0,1860661.0,2016,41.773455,-87.706480,"(41.773455295, -87.706480471)"

In [89]:
#q1
#Find the total number of crimes recorded in the CRIME table.
pd.read_sql_query('Select COUNT(CASE_NUMBER) from crime',con = engine)

   COUNT(CASE_NUMBER)
0                 533

In [88]:
#q2
#List community areas with per capita income less than 11000
pd.read_sql_query('Select COMMUNITY_AREA_NAME, PER_CAPITA_INCOME from census WHERE PER_CAPITA_INCOME < 11000',con = engine)

  COMMUNITY_AREA_NAME  PER_CAPITA_INCOME
0  West Garfield Park              10934
1      South Lawndale              10402
2         Fuller Park              10432
3           Riverdale               8201

In [95]:
#q3
#List all case numbers for crimes involving minors?
#(children are not considered minors for the purposes of crime analysis)
df=pd.read_sql_query('Select CASE_NUMBER,DESCRIPTION from crime WHERE DESCRIPTION like "%MINOR%"',con = engine)
df

  CASE_NUMBER                    DESCRIPTION
0    HL266884  SELL/GIVE/DEL LIQUOR TO MINOR
1    HK238408   ILLEGAL CONSUMPTION BY MINOR

In [97]:
#q4
#List all kidnapping crimes involving a child?
df=pd.read_sql_query('Select PRIMARY_TYPE,DESCRIPTION from crime WHERE PRIMARY_TYPE like "%KIDNAP%" and DESCRIPTION like "%CHILD%"',con = engine)
df

  PRIMARY_TYPE               DESCRIPTION
0   KIDNAPPING  CHILD ABDUCTION/STRANGER

In [101]:
#q5
#What kinds of crimes were recorded at schools?
df=pd.read_sql_query('Select distinct PRIMARY_TYPE from crime WHERE LOCATION_DESCRIPTION like "%school%" or LOCATION_DESCRIPTION like "%college%"',con = engine)
df

             PRIMARY_TYPE
0                 BATTERY
1         CRIMINAL DAMAGE
2               NARCOTICS
3                 ASSAULT
4       CRIMINAL TRESPASS
5  PUBLIC PEACE VIOLATION

In [124]:
#q6
#List the average safety score for all types of schools.
df=pd.read_sql_query(
'select "Elementary, Middle, or High School", avg(safety_score) as "Avg Score" from school group by "Elementary, Middle, or High School"', con=engine)
df

  Elementary, Middle, or High School  Avg Score
0                                 ES  49.520384
1                                 HS  49.623529
2                                 MS  48.000000

In [112]:
#q7
#List 5 community areas with highest % of households below poverty line
df=pd.read_sql_query(
'select "Elementary, Middle, or High School", avg(safety_score) as "Avg Score" from school group by "Elementary, Middle, or High School"', con=engine)
df

   AVG(safety_score)
0          50.397163

In [132]:
#q8
#Which community area is most crime prone?
df=pd.read_sql_query('Select COMMUNITY_AREA_NUMBER, count(COMMUNITY_AREA_NUMBER) as Total from crime group by COMMUNITY_AREA_NUMBER order by Total desc limit 1',con = engine)
df

   COMMUNITY_AREA_NUMBER  Total
0                   25.0     43

In [136]:
#q9
#Use a sub-query to find the name of the community area with highest hardship index
df=pd.read_sql_query('Select COMMUNITY_AREA_NUMBER, count(COMMUNITY_AREA_NUMBER) as Total from crime group by COMMUNITY_AREA_NUMBER order by Total desc limit 1',con = engine)
df

  COMMUNITY_AREA_NAME  HARDSHIP_INDEX
0           Riverdale            98.0

In [168]:
#q10
#Use a sub-query to determine the Community Area Name with most number of crimes?
df=pd.read_sql_query('Select COMMUNITY_AREA_NUMBER, count(COMMUNITY_AREA_NUMBER) as Total from crime group by COMMUNITY_AREA_NUMBER order by Total desc limit 1',con = engine)
df

   COMMUNITY_AREA_NUMBER  Total
0                   25.0     43

In [175]:
df=pd.read_sql_query('Select COMMUNITY_AREA_NUMBER, COMMUNITY_AREA_NAME from census',con = engine)
df

    COMMUNITY_AREA_NUMBER COMMUNITY_AREA_NAME
0                     1.0         Rogers Park
1                     2.0          West Ridge
2                     3.0              Uptown
3                     4.0      Lincoln Square
4                     5.0        North Center
..                    ...                 ...
73                   74.0     Mount Greenwood
74                   75.0         Morgan Park
75                   76.0              O'Hare
76                   77.0           Edgewater
77                    NaN             CHICAGO

[78 rows x 2 columns]

In [ ]:
COMMUNITY_AREA_NUMBER = 25

In [ ]:
select from where, select from where
select from where (select from where) #where
select from (select from where), where #from
select (select from where) from where #select

In [ ]:
df=pd.read_sql_query('Select COMMUNITY_AREA_NAME from (COMMUNITY_AREA_NAME from census = COMMUNITY_AREA_NUMBER from crime) where select (COUNT(PRIMARY_TYPE)= MAX from crime)',con = engine)
df

In [ ]:
COMMUNITY_AREA_NUMBER = 25

In [170]:
census.columns

Index(['COMMUNITY_AREA_NUMBER', 'COMMUNITY_AREA_NAME',
       'PERCENT_OF_HOUSING_CROWDED', 'PERCENT_HOUSEHOLDS_BELOW_POVERTY',
       'PERCENT_AGED_16__UNEMPLOYED',
       'PERCENT_AGED_25__WITHOUT_HIGH_SCHOOL_DIPLOMA',
       'PERCENT_AGED_UNDER_18_OR_OVER_64', 'PER_CAPITA_INCOME',
       'HARDSHIP_INDEX'],
      dtype='object')

In [139]:
crime.columns

Index(['ID', 'CASE_NUMBER', 'DATE', 'BLOCK', 'IUCR', 'PRIMARY_TYPE',
       'DESCRIPTION', 'LOCATION_DESCRIPTION', 'ARREST', 'DOMESTIC', 'BEAT',
       'DISTRICT', 'WARD', 'COMMUNITY_AREA_NUMBER', 'FBICODE', 'X_COORDINATE',
       'Y_COORDINATE', 'YEAR', 'LATITUDE', 'LONGITUDE', 'LOCATION'],
      dtype='object')